module.exports = {
  email: {
    inviteSubject: (group) => `Запрошення до групи "${group}"`,
    inviteHeader: 'Вас запрошено до групи у Starlace Memories!',
    inviteBody: (group, roleText) => `Ви отримали запрошення приєднатися до групи <b>"${group}"</b> у ролі ${roleText}`,
    roleMember: '<i>Учасника</i>. Ви зможете додавати, переглядати спогади та ділитися своїми враженнями!',
    roleViewer: '<i>Читача</i>. Ви зможете переглядати спогади та ділитися своїми враженнями!',
    inviteAction: 'Натисніть на кнопку нижче, щоб прийняти запрошення:',
    btnJoin: 'Приєднатися',
    inviteValidity: 'Це посилання дійсне протягом 48 годин.',
    
    resetSubject: 'Відновлення доступу до профілю у Starlace Memories',
    resetGreeting: (name) => `Вітаємо, ${name}!`,
    resetReqText: 'Ми отримали запит на скидання пароля для Вашого облікового запису <b>Starlace Memories</b>.',
    resetInstruction: 'Щоб створити новий пароль та відновити доступ до своїх груп та спогадів, будь ласка, натисніть на кнопку нижче:',
    btnReset: 'Створити новий пароль',
    resetAltLink: 'Якщо кнопка не працює, перейдіть за цим посиланням:',
    resetValidity: 'Це посилання дійсне лише <b>1 годину</b>.',
    resetIgnore: 'Якщо Ви не надсилали цей запит, просто проігноруйте цей лист.'
  }
};